function [ Pnorm, k, b ] = MyNormlizeMat( P, Pmin, Pmax )
%********************************************************************************************************************
%**********************              Copyright: GGEC. Author: Kailing YI. 2023,02,08               **********************
%********************************************************************************************************************
% 函数 实现 将 数组数据P 线性归一化 至 [Pmin, Pmax], 得到 Pnorm.
Dw = min(P, [], 'all'); Up = max(P, [], 'all'); k = (Pmax - Pmin) / (Up - Dw);
b = Pmax - k * Up; Pnorm = k .* P + b;          % 线性归一化: y = k .* x+b.
end

